<script setup lang="ts">
//#region Imports
//#endregion

//#region Instance
const route = useRoute()
//#endregion

//#region Variables
const loading = ref(true)
const items = ref<any[]>([
  {
    id: 1,
    title: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف به ابعاد ۲۰۶×۱۴۲ دارای مهر اصالت و نشان یونسکو رقم علی خوشنویس زاده اصفهانی سال تولید ۱۳۹۴ زمان اجرا چهار سال محل رونمایی مصلی تهران و موزه هنرهای معاصر اصفهان محل نگهداری اطاق بازرگانی اصفهان قیمت دوازده ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/1.jpeg`
  },
  {
    id: 2,
    title: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم به ابعاد ۱۷۲×۱۶۸ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۲ زمان اجرا سه سال محل رونمایی نگارستان امام خمینی محل نگهداری مجموعه موزه شخصی قیمت ده میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/2.jpeg`
  },
  {
    id: 3,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) به ابعاد ۱۹۲×۱۴۲ رقم علی خوشنویس زاده اصفهانی سال تولید ۱۴۰۲ زمان اجرا سه سال دارای مهر اصالت و نشان یونسکو محل رونمایی نمایشگاه بین‌المللی اصفهان محل نگهداری مجموعه موزه شخصی قیمت یک ملیون دلار`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/3.jpeg`
  },
  {
    id: 4,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو محل رونمایی نقش خانه میدان امام اصفهان سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/4.jpeg`
  },
  {
    id: 5,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به ابعاد ۷۵×۵۵ به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو تولید ۱۳۹۶ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/5.jpeg`
  },
  {
    id: 6,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/6.jpeg`
  },
  {
    id: 7,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ دارای مهر اصالت و نشان یونسکو زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/7.jpeg`
  },
  {
    id: 8,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/8.jpeg`
  },
  {
    id: 9,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/9.jpeg`
  },
  {
    id: 10,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/10.jpeg`
  },
  {
    id: 11,
    title: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۴ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/11.jpeg`
  },
  {
    id: 12,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۵۲×۱۰۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/12.jpeg`
  },
  {
    id: 13,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۶۲×۱۱۲ سال تولید ۱۳۵۶ زمان اجرا چهار ده ماه محل رونمایی نمایشگاه بین‌المللی تهران سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/13.jpeg`
  },
  {
    id: 14,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۰۲×۷۲ سال تولید ۱۳۵۲ زمان اجرا چهار ده ماه محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/14.jpeg`
  },
  {
    id: 15,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۷۴×۱۶۸ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۸۵ زمان اجرا پنج سال محل نگهداری مجموعه موزه شخصی قیمت چهار ده میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/15.jpeg`
  },
  {
    id: 16,
    title: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل رقم علی خوشنویس زاده اصفهانی به ابعاد ۵۸×۴۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/16.jpeg`
  },
  {
    id: 17,
    title: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۵۸×۴۲ سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/17.jpeg`
  }
])
const data = ref<any>({
  title:'',
  description:'',
  image:'',
  similar:[],
  user:{
    title:'علی خوش نویس زاده',
    description:'سال 1327 در اصفهان متولد شد. هنر سوخت در خانواده‌شان موروثی بود و پدرش مرحوم حسین خوشنویس‌زاده اصفهانی و جد او در حوزه هنر، علم و اجتهاد و به‌خصوص هنر سوخت مشغول بوده‌اند. او نیز از ۱۳ سالگی این هنر را شروع کرد. اولین استادش پدرش بود. سپس نزد استاد حاج مصورالملکی، نگارگری و نقاشی آموخت و در محضر اساتیدی چون محمد تجویدی، حسین بهزاد و حسن زرین‌خط، خوشنویسی را آموزش دید.\n' +
        '\n' +
        'تحصیلات ابتدایی و مقدماتی را در دارالفنون تهران گذراند و پس از اتمام تحصیلات آکادمیک و خدمت نظام وظیفه در تهران، سال 13۴۹ به زادگاه خود اصفهان بازگشت و آموختن هنر سوخت را ادامه داد. اولین تابلوی مستقل خود را در سی سالگی به ثمر رساند. آن زمان پدرش در قید حیات بود و هنگامی که تابلو را دید اشک شوق ریخت.\n' +
        '\n' +
        'علی خوشنویس‌زاده اصفهانی اکنون یکی از استادان هنر سوخت است که تاکنون در نمایشگاه‌های متعددی در داخل و خارج  کشور شرکت و بیش از ۱۰۰ لوح تقدیر دریافت کرده است. او در سال ۱۳۹۱ موفق به اخذ تأیید مهر اصالت از سازمان جهانی یونسکو شد. آثارش در مجموعه‌های شخصی و موزه‌های ملی موجود است.\n' +
        '\n' +
        'استاد خوشنویس‌زاده در بیش از۶۰ پایان‌نامه مقطع کارشناسی و کارشناسی ارشد با موضوع هنر سوخت، به عنوان استاد راهنما و مشاور فعالیت کرده و کتابی در زمینه این هنر با عنوان «پیدایش و سیر تحول و تکامل هنر سوخت» تألیف کرده است.\n' +
        '\n' +
        'حدود ۳۰ سال است که در دانشگاه هنر، دانشگاه نقش جهان و در سازمان میراث فرهنگی و صنایع دستی مشغول تدریس است و در این مدت بیش از ۷۰۰ هنرجو را تعلیم داده است. او گاهی اوقات در کارگاه خصوصی‌اش برای هنرجویانی که خیلی مستعد باشند آموزش می‌گذارد.\n' +
        '\n' +
        'در خلق آثارش پیرو مکتب صفوی است و به همه دانشجویان و هنرجویانش هم این مکتب را توصیه می‌کند؛ زیرا عقیده دارد هنر نگارگری و نقاشی در مکتب صفویه به کمال می‌رسد.\n' +
        '\n' +
        'استاد علی خوشنویس‌زاده اصفهانی مدرک درجه یک هنری دارد و از سال 1397 عضو مؤسسه هنرمندان پیشکسوت است.',
    avatar:'/img/avatar.jpg',
  },
})
const qr = ref<any>('')
//#endregion

//#region Function
//#endregion
//#region LifeCycle
onMounted(async () => {
  if (process.client) {
    qr.value =  window.location.origin + route.fullPath
  }
  // qr.value = route.fullPath
  let x = items.value.find((it:any)=>it.id == route.params.code)
  data.value.title  = x.title;
  data.value.description  = x.description;
  data.value.image  = x.image;
  data.value.title  = x.title;
  loading.value = false
})
//#endregion
</script>

<template>
  <div class="w-full h-full min-h-[100dvh] p-5 flex justify-center items-start mt-16">
    <div class="w-full h-full flex flex-col justify-start items-start">

      <div class="flex flex-col mt-5">
        <div class="flex w-full justify-center items-center flex-col">
          <img :src="data.user.avatar" alt="avatar" class="rounded-full size-28"/>
          <span class="Estedad_FD_Bold my-3">{{data.user.title}}</span>
        </div>
        <p class="Estedad_FD_Light text-xs text-justify leading-6">{{data.user.description}}</p>


        <div class="my-5">

          <qrcode-vue
              level="M"
              render-as="svg"
              size="130"
              :value="qr"
              :margin="2"
              background="#ffffff"
              foreground='#000000'
              class="m-auto"/>

        </div>
      </div>

      <div class="flex flex-col  mt-5">
        <span class="Estedad_FD_Bold mb-3">آثار</span>
        <div class="w-full gap-6 p-2 columns-1 sm:columns-4 sm:gap-8 sm:p-4">
          <masonry-grid :items="items" :loading="loading" :skeleton-count="9" />
        </div>
      </div>
    </div>
  </div>
</template>
