<script setup lang="ts">
//#region Imports
//#endregion

//#region Instance
//#endregion

//#region Variables
const loading = ref(true)
const items = ref<any[]>([
  {
    id: 1,
    title: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف به ابعاد ۲۰۶×۱۴۲ دارای مهر اصالت و نشان یونسکو رقم علی خوشنویس زاده اصفهانی سال تولید ۱۳۹۴ زمان اجرا چهار سال محل رونمایی مصلی تهران و موزه هنرهای معاصر اصفهان محل نگهداری اطاق بازرگانی اصفهان قیمت دوازده ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/1.jpeg`
  },
  {
    id: 2,
    title: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم به ابعاد ۱۷۲×۱۶۸ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۲ زمان اجرا سه سال محل رونمایی نگارستان امام خمینی محل نگهداری مجموعه موزه شخصی قیمت ده میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/2.jpeg`
  },
  {
    id: 3,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) به ابعاد ۱۹۲×۱۴۲ رقم علی خوشنویس زاده اصفهانی سال تولید ۱۴۰۲ زمان اجرا سه سال دارای مهر اصالت و نشان یونسکو محل رونمایی نمایشگاه بین‌المللی اصفهان محل نگهداری مجموعه موزه شخصی قیمت یک ملیون دلار`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/3.jpeg`
  },
  {
    id: 4,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو محل رونمایی نقش خانه میدان امام اصفهان سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/4.jpeg`
  },
  {
    id: 5,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به ابعاد ۷۵×۵۵ به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو تولید ۱۳۹۶ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/5.jpeg`
  },
  {
    id: 6,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/6.jpeg`
  },
  {
    id: 7,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ دارای مهر اصالت و نشان یونسکو زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/7.jpeg`
  },
  {
    id: 8,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/8.jpeg`
  },
  {
    id: 9,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/9.jpeg`
  },
  {
    id: 10,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/10.jpeg`
  },
  {
    id: 11,
    title: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۴ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/11.jpeg`
  },
  {
    id: 12,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۵۲×۱۰۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/12.jpeg`
  },
  {
    id: 13,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۶۲×۱۱۲ سال تولید ۱۳۵۶ زمان اجرا چهار ده ماه محل رونمایی نمایشگاه بین‌المللی تهران سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/13.jpeg`
  },
  {
    id: 14,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۰۲×۷۲ سال تولید ۱۳۵۲ زمان اجرا چهار ده ماه محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/14.jpeg`
  },
  {
    id: 15,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۷۴×۱۶۸ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۸۵ زمان اجرا پنج سال محل نگهداری مجموعه موزه شخصی قیمت چهار ده میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/15.jpeg`
  },
  {
    id: 16,
    title: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل رقم علی خوشنویس زاده اصفهانی به ابعاد ۵۸×۴۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/16.jpeg`
  },
  {
    id: 17,
    title: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۵۸×۴۲ سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/17.jpeg`
  }
])
//#endregion

//#region Function
const search = () => {

}
//#endregion
//#region LifeCycle
onMounted(async () => {
  // setTimeout(() => {
  //   items.value = Array.from({ length: 15 }).map((_, i) => ({
  //     id: i,
  //     title: `Item ${i + 1}`,
  //     author: `علی خوش نویس زاده`,
  //     avatar: `https://picsum.photos/400/${300 + i * 10}`,
  //     image: `https://picsum.photos/400/${300 + i * 10}`
  //   }))
  //   loading.value = false
  // }, 1500)

  loading.value = false
})
//#endregion
</script>

<template>
  <div class="container gap-6 p-2 columns-2 sm:columns-6 sm:gap-8 sm:p-4 mt-18">
    <masonry-grid :items="items" :loading="loading" :skeleton-count="9" />
  </div>
</template>
