<script setup lang="ts">
//#region Imports
//#endregion

//#region Instance
const route = useRoute()
//#endregion

//#region Variables
const loading = ref(true)
const items = ref<any[]>([
  {
    id: 1,
    title: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع رویای عارف به ابعاد ۲۰۶×۱۴۲ دارای مهر اصالت و نشان یونسکو رقم علی خوشنویس زاده اصفهانی سال تولید ۱۳۹۴ زمان اجرا چهار سال محل رونمایی مصلی تهران و موزه هنرهای معاصر اصفهان محل نگهداری اطاق بازرگانی اصفهان قیمت دوازده ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/1.jpeg`
  },
  {
    id: 2,
    title: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع مجلس بزم به ابعاد ۱۷۲×۱۶۸ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۲ زمان اجرا سه سال محل رونمایی نگارستان امام خمینی محل نگهداری مجموعه موزه شخصی قیمت ده میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/2.jpeg`
  },
  {
    id: 3,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سفر معراج پیامبر اعظم(ص) به ابعاد ۱۹۲×۱۴۲ رقم علی خوشنویس زاده اصفهانی سال تولید ۱۴۰۲ زمان اجرا سه سال دارای مهر اصالت و نشان یونسکو محل رونمایی نمایشگاه بین‌المللی اصفهان محل نگهداری مجموعه موزه شخصی قیمت یک ملیون دلار`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/3.jpeg`
  },
  {
    id: 4,
    title: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع سیاه مشق به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو محل رونمایی نقش خانه میدان امام اصفهان سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/4.jpeg`
  },
  {
    id: 5,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به ابعاد ۷۵×۵۵ به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو تولید ۱۳۹۶ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/5.jpeg`
  },
  {
    id: 6,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خط چلیپا به خط حضرت میر عمادالحسنی عصر صفویه رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/6.jpeg`
  },
  {
    id: 7,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی به خط حضرت میر عمادالحسنی رقم علی خوشنویس زاده اصفهانی به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ دارای مهر اصالت و نشان یونسکو زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/7.jpeg`
  },
  {
    id: 8,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میر علی هروی عصر تیموری رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/8.jpeg`
  },
  {
    id: 9,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/9.jpeg`
  },
  {
    id: 10,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خوشنویسی چلیپا به خط میرزا غلام رضا اصفهانی عصر قاجار رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۲ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/10.jpeg`
  },
  {
    id: 11,
    title: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ `,
    description: `تابلو سوخت معرق و منبت چرم با موضوع گل ومرغ رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۷۵×۵۵ سال تولید ۱۳۹۴ زمان اجرا هشت ماه محل رونمایی نقش خانه میدان امام اصفهان سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/11.jpeg`
  },
  {
    id: 12,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۵۲×۱۰۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/12.jpeg`
  },
  {
    id: 13,
    title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۶۲×۱۱۲ سال تولید ۱۳۵۶ زمان اجرا چهار ده ماه محل رونمایی نمایشگاه بین‌المللی تهران سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/13.jpeg`
  },
  {
    id: 14,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۰۲×۷۲ سال تولید ۱۳۵۲ زمان اجرا چهار ده ماه محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/14.jpeg`
  },
  {
    id: 15,
    title: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۷۴×۱۶۸ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۸۵ زمان اجرا پنج سال محل نگهداری مجموعه موزه شخصی قیمت چهار ده میلیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/15.jpeg`
  },
  {
    id: 16,
    title: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل رقم علی خوشنویس زاده اصفهانی به ابعاد ۵۸×۴۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/16.jpeg`
  },
  {
    id: 17,
    title: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز`,
    description: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۵۸×۴۲ سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
    author: `علی خوش نویس زاده`,
    avatar: `/img/avatar.jpg`,
    image: `/img/art/17.jpeg`
  }
])
const data = ref<any>({
  title:'',
  description:'',
  image:'',
  similar:[],
  user:{
    title:'علی خوش نویس زاده',
    description:'سال 1327 در اصفهان متولد شد. هنر سوخت در خانواده‌شان موروثی بود و پدرش مرحوم حسین خوشنویس‌زاده اصفهانی و جد او در حوزه هنر، علم و اجتهاد و به‌خصوص هنر سوخت مشغول بوده‌اند. او نیز از ۱۳ سالگی این هنر را شروع کرد. اولین استادش پدرش بود. سپس نزد استاد حاج مصورالملکی، نگارگری و نقاشی آموخت و در محضر اساتیدی چون محمد تجویدی، حسین بهزاد و حسن زرین‌خط، خوشنویسی را آموزش دید. استاد علی خوشنویس‌زاده اصفهانی مدرک درجه یک هنری دارد و از سال 1397 عضو مؤسسه هنرمندان پیشکسوت است.',
    avatar:'/img/avatar.jpg',
  },
})
//#endregion

//#region Function
//#endregion
//#region LifeCycle
onMounted(async () => {

  console.log(route.params.code)


  let x = items.value.find((it:any)=>it.id == route.params.code)
    data.value.title  = x.title;
  data.value.description  = x.description;
  data.value.image  = x.image;
  data.value.title  = x.title;
    data.value.similar = [

      {
        id: 12,
        title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۵۲×۱۰۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/12.jpeg`
      },
      {
        id: 13,
        title: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع شکارگاه بهرام شاه رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۶۲×۱۱۲ سال تولید ۱۳۵۶ زمان اجرا چهار ده ماه محل رونمایی نمایشگاه بین‌المللی تهران سال ۱۳۹۶ محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/13.jpeg`
      },
      {
        id: 14,
        title: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع خیام اگر ز باده مستی خوش باش رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۱۰۲×۷۲ سال تولید ۱۳۵۲ زمان اجرا چهار ده ماه محل نگهداری مجموعه موزه شخصی قیمت پنج میلیارد تومان.`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/14.jpeg`
      },
      {
        id: 15,
        title: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع خسرو، شیرین رقم علی خوشنویس زاده اصفهانی به ابعاد ۱۷۴×۱۶۸ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۸۵ زمان اجرا پنج سال محل نگهداری مجموعه موزه شخصی قیمت چهار ده میلیارد تومان.`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/15.jpeg`
      },
      {
        id: 16,
        title: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع کعبه دل رقم علی خوشنویس زاده اصفهانی به ابعاد ۵۸×۴۳ دارای مهر اصالت و نشان یونسکو سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان.`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/16.jpeg`
      },
      {
        id: 17,
        title: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز`,
        description: `تابلو سوخت معرق و منبت چرم با موضوع دختر طناز رقم علی خوشنویس زاده اصفهانی دارای مهر اصالت و نشان یونسکو به ابعاد ۵۸×۴۲ سال تولید ۱۳۵۶ زمان اجرا هشت ماه محل نگهداری مجموعه موزه شخصی قیمت دو ملیارد تومان`,
        author: `علی خوش نویس زاده`,
        avatar: `/img/avatar.jpg`,
        image: `/img/art/17.jpeg`
      }
    ]
    loading.value = false
})
//#endregion
</script>

<template>
  <div class="w-full h-full min-h-[100dvh] p-5 flex justify-center items-start mt-16">
    <div class="w-1/3 h-full flex flex-col justify-start items-start">

      <div class="flex flex-col mt-5">
        <div class="flex w-full justify-center items-center flex-col">
          <img :src="data.user.avatar" alt="avatar" class="rounded-full size-28"/>
          <span class="Estedad_FD_Bold my-3">{{data.user.title}}</span>
        </div>
        <p class="Estedad_FD_Light text-xs text-justify leading-6">{{data.user.description}}</p>
      </div>

      <div class="flex flex-col mt-5">
        <span class="Estedad_FD_Bold mb-3"> درباره اثر </span>
        <p class="Estedad_FD_Light text-xs text-justify leading-6">
{{data.description}}
        </p>
      </div>

      <div class="flex flex-col  mt-5">
        <span class="Estedad_FD_Bold mb-3">سایر آثار</span>
        <div class="w-full gap-6 p-2 columns-1 sm:columns-2 sm:gap-8 sm:p-4">
          <masonry-grid :items="data.similar" :loading="loading" :skeleton-count="9" />
        </div>
      </div>
    </div>
    <div class="w-2/3 flex px-5 justify-center items-start">
      <img :src="data.image" alt="image" class="w-full object-contain rounded-lg"/>
    </div>
  </div>
</template>
